from collections import OrderedDict

# region: Сообщения, связанные с главной клавиатурой
MAIN_MSG = 'Выберите интересующую Вас опцию:'
NEW_DONOR = 'Готов стать донором'
EDIT_DONOR = 'Изменить мои данные'
FIND_DONOR = 'Найти донора'
# endregion


# region: Общие сообщения
TO_MAIN_MENU = 'Назад в главное меню'
BACK_TO_MAIN_DECISION = 'Вы решили вернуться в главное меню.'
BACK_TO_MAIN = 'BACK'
BIRTH_DATE_ERROR = 'Кажется, ваша дата рождения имеет неверный формат. ' \
                   'Проверьте формат (ДД/ММ/ГГГГ или ДД.ММ.ГГГГ) и попробуйте еще раз:'
GEO_INFO = 'Обратите внимание, данная геопозиция должна быть *максимально* точной.\n' \
           'Вы можете поделиться ею с нами двумя способами:\n' \
           '1) Нажать на кнопку "Поделиться местоположением" — ' \
           'тогда мы используем вашу *текщую* геопозицию;\n' \
           '2) Отправить метку на карте.'
# endregion


# region: Сообщения, связанные с регистрацией / изменением данных донора
START_REG = 'Спасибо, что Вы приняли смелое решение. Вы спасаете чью-то жизнь.'
HOW_OLD = 'Введите дату Вашего рождения в формате ДД/ММ/ГГГГ или ДД.ММ.ГГГГ:'
DATE_REGEXP = r'^\d{1,2}[/.]\d{1,2}[/.]\d{4}$'
AGE_YOUNG = 'К сожалению, Вы еще не достигли совершеннолетия. ' \
            'Тем не менее, Вы можете воспользоваться поиском донора.'
CHOOSE_BLOOD_TYPE = 'Выберите Вашу группу крови:'
BLOOD_TYPES = OrderedDict([(1, '0 (I)'),
                           (2, 'A (II)'),
                           (3, 'B (III)'),
                           (4, 'AB (VI)')])
DATE_BT_DATA_REGEXP = r'^birth:\d{1,2}\.\d{1,2}\.\d{4},bt:\d$'
CHOOSE_RH_TYPE = 'Выберите Ваш резус-фактор:'
RH_TYPES = OrderedDict([(0, 'Rh- (Отрицательный)'),
                        (1, 'Rh+ (Положительный)'),
                        (2, 'Не знаю')])
DATE_BT_RH_DATA_REGEXP = r'^birth:\d{1,2}\.\d{1,2}\.\d{4},bt:\d,rh:\d$'
SUCCESS_REG = 'Вы успешно зарегистрированы!\n' \
              'Вы всегда сможете изменить свои данные нажатием на кнопку "Изменить мои данные".'
REG_GEO_REQUIRE = 'Нам также необходимо знать Ваше обычное местоположение.\n' + GEO_INFO
REG_GEO_REPLY = 'Ваше обычное местоположение:'

MAIN_CHANGER = ['Что вы хотите изменить?',
                ('birth', 'Дата рождения'),
                ('bt', 'Группа крови'),
                ('rh', 'Резус-фактор'),
                ('geo', 'Моё местоположение')]

USER_INFO_TMPL = 'Ваши текущие данные:\n' \
                 'Дата рождения: {birth_fmt}\n' \
                 'Группа крови: {bt_fmt}\n' \
                 'Резус-фактор: {rh_fmt}'

SHARE_PHONE = 'Поделиться номером телефона'
SHARE_LOCATION = 'Поделиться местоположением'

BIRTH_CHANGER_REGEXP = r'^birth$'
BT_CHANGER_REGEXP = r'^bt$'
RH_CHANGER_REGEXP = r'^rh$'
GEO_CHANGER_REGEXP = r'^geo$'

BIRTH_CHANGE_SUCCESS = 'Ваша дата рождения успешно обновлена.'
BT_DATA_CHANGE_REGEXP = r'^bt:\d$'
BT_CHANGE_SUCCESS = 'Ваша группа крови успешно обновлена.'
RH_DATA_CHANGE_REGEXP = r'^rh:\d$'
RH_CHANGE_SUCCESS = 'Ваш резус-фактор успешно обновлен.'
GEO_CHANGE_REPLY = 'Ваше новое местоположение:'
GEO_USER_CHANGE_SUCCESS = 'Спасибо, теперь мы сможем сообщать Вам только о релевантных поисках доноров.'
# endregion


# region: Сообщения, связанные с созданием заявки на поиск донора
MAIN_REQUEST = 'Вы переходите к созданию заявки на поиск донора.\n' \
               'Убедительно просим Вас не создавать заявок без необходимости.\n'

BACK_OR_PROCEED = 'Для продолжения нажмите "Далее" или вернитесь в главное меню.'
REQUEST_PROCEED = 'Далее'
RQ_INIT = 'rq_init'
RQ_CHOOSE_BT = 'Выберете необходимую группу крови:'
RQ_BT_REGEXP = r'^rq!bt:\d$'
RQ_CHOOSE_RH = 'Выберете необходимый резус-фактор:'
RQ_BT_RH_REGEXP = r'^rq!bt:\d,rh:\d$'
RQ_COMMENT_REQUIRE = 'Предоставьте необходимую информацию о сложившейся ситуации в краткой форме.\n' \
                     'Настоятеьно рекомендуем Вам указать следующее:\n' \
                     '1) Место кроводачи и его адрес;\n' \
                     '2) Время, в течение которого необходимо и возможно сдать кровь.'
RQ_COMMENT_REPLY = 'Ваше описание:'
RQ_GEO_REQUIRE = 'Для поиска доноров нам также нужно знать геопозицию места кроводачи.\n' + GEO_INFO
RQ_GEO_REPLY = 'Геопозиция кроводачи:'
RQ_PHONE_REQUIRE = 'Возможно, доноры захотят связаться с Вами.\n' \
                   'Вы можете поделиться номером своего телефона или же пропустить данный шаг.'
RQ_PHONE_ACTIONS = 'Выберите действие:'
RQ_SKIP_PHONE = 'Пропустить'
RQ_PHONE_SKIPPED = 'К сожалению, потенциальный донор не сможет связаться с Вами, ' \
                   'если ему потребуется дополнительая информация.'
RQ_PHONE_CHEATING = 'Пожалуйста, отнеситесь к этому ответственно.\n' \
                    'Поделитесь тем номером телефона, который в действительности Вам принадлежит.'
RQ_PHONE_NEED_TELEGRAM = 'Пожалуйста, поделитесь тем номером телефона, к которому привязан ваш Telegram-аккаунт.'
RQ_PHONE_TRY_AGAIN = 'Попробуйте отправить нам свой контакт еще раз или же пропустите данные шаг.'
RQ_PHONE_SUCCESS = 'Теперь c Вами смогут связаться в случае необходимости.'
RQ_FINAL_STEP = 'Все необходимые данные сохранены.\n' \
                'Нажмите "Начать поиск", если вы хотите найти доноров, в противном случае вернитесь в главное меню.'
RQ_START_DONOR_SEARCH = 'Начать поиск'
RQ_APPLY = 'dsstrt'
RQ_SEARCH_START = 'Потенциальные доноры будут оповещены в ближайший час.'
# endregion

